README.md
```mermaid
erDiagram
    USERS {
        uuid id PK
        text email
        text password_hashed
        timestamp created_at
    }

    MUSCLE_CATEGORIES {
        uuid id PK
        uuid user_id
        text name
    }

    MUSCLE_GROUPS {
        uuid id PK
        uuid user_id
        uuid category
        text name
    }

    EXERCISES {
        uuid id PK
        uuid user_id
        uuid muscle_group_id
        text name
    }

    WORKOUTS {
        uuid id PK
        uuid user_id
        text name
    }

    SESSIONS {
        uuid id PK
        uuid workout_id
        timestamp created_at
    }

    SESSION_EXERCISES {
        uuid id PK
        uuid session_id
        uuid exercise_id
        int exercise_number
    }

    SETS {
        uuid id PK
        uuid session_exercise_id
        int set_number
        double weight
        int reps
        boolean warmup
    }

    USERS ||--o{ WORKOUTS : owns_and_creates
    USERS ||--o{ EXERCISES : owns_and_creates
    USERS ||--o{ MUSCLE_CATEGORIES : owns_and_creates
    USERS ||--o{ MUSCLE_GROUPS : owns_and_creates

    MUSCLE_CATEGORIES ||--o{ MUSCLE_GROUPS : categorises
    MUSCLE_GROUPS ||--o{ EXERCISES : categorises

    WORKOUTS ||--o{ SESSIONS : has
    SESSIONS ||--o{ SESSION_EXERCISES : has
    EXERCISES ||--o{ SESSION_EXERCISES : performed_as
    SESSION_EXERCISES ||--o{ SETS : has
```
